results/results_1/aggregated/out/test1-4img-rate4-total600-out256-restarted/output.txt
[Sun Jul 26 06:20:48 AM UTC 2026] Waiting for http://aggregation-epp:80/v1/models ...
  Endpoint up.

[Sun Jul 26 06:20:48 AM UTC 2026] === Rate 4 ===
/usr/local/lib/python3.12/dist-packages/torchao/quantization/quant_api.py:1731: SyntaxWarning: invalid escape sequence '\.'
  """Configuration class for applying different quantization configs to modules or parameters based on their fully qualified names (FQNs).
/sgl-workspace/sglang/python/sglang/srt/layers/attention/fla/utils.py:223: UserWarning: Triton is not supported on current platform, roll back to CPU.
  warnings.warn(
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
[transformers] The `use_fast` parameter is deprecated and will be removed in a future version. Use `backend="torchvision"` instead of `use_fast=True`, or `backend="pil"` instead of `use_fast=False`.
/sgl-workspace/sglang/python/sglang/benchmark/datasets/image.py:51: UserWarning: High resolution (1920x1080) with 2400 total images may take a long time. Consider reducing resolution or image count.
  return sample_image_requests(
benchmark_args=Namespace(backend='sglang-oai-chat', base_url=None, host='aggregation-epp', port=80, ready_check_timeout_sec=60, dataset_name='image', dataset_path='', speed_bench_category=None, speed_bench_output_len=512, model='Qwen/Qwen3-VL-235B-A22B-Instruct-FP8', served_model_name=None, tokenizer=None, num_prompts=600, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=128, random_output_len=256, random_range_ratio=1.0, image_count=4, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=4.0, use_trace_timestamps=False, max_concurrency=None, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=3721, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body='{"ignore_eos": true}', apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://aggregation-epp:80/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang-oai-chat', base_url=None, host='aggregation-epp', port=80, ready_check_timeout_sec=60, dataset_name='image', dataset_path='', speed_bench_category=None, speed_bench_output_len=512, model='Qwen/Qwen3-VL-235B-A22B-Instruct-FP8', served_model_name=None, tokenizer=None, num_prompts=600, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=128, random_output_len=256, random_range_ratio=1.0, image_count=4, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=4.0, use_trace_timestamps=False, max_concurrency=None, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=3721, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body='{"ignore_eos": true}', apply_chat_template=True, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 4986275
#Output tokens: 153600
#Total images: 2400
#Images per request: 4 (fixed)

=== Token Breakdown (per request avg / total) ===
  Raw text prompt tokens (without overhead): avg=128.0, total=76800
  Text prompt tokens (with chat template): avg=142.5, total=85475
  Text prompt overhead: avg=14.5, total=8675
  Vision tokens: avg=8168.0, total=4900800

Created 600 random jpeg images with average 8359341 bytes per request
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...

  0%|          | 0/600 [00:00<?, ?it/s]
  0%|          | 1/600 [01:30<15:04:28, 90.60s/it]
  0%|          | 2/600 [01:31<6:18:09, 37.94s/it] 
  0%|          | 3/600 [01:32<3:28:19, 20.94s/it]
  1%|          | 4/600 [01:33<2:08:38, 12.95s/it]
  1%|          | 5/600 [01:33<1:24:37,  8.53s/it]
  1%|          | 7/600 [01:34<43:24,  4.39s/it]  
  1%|▏         | 8/600 [01:34<32:52,  3.33s/it]
  2%|▏         | 9/600 [01:35<24:58,  2.53s/it]
  2%|▏         | 10/600 [01:35<19:05,  1.94s/it]
  2%|▏         | 11/600 [01:36<14:48,  1.51s/it]
  2%|▏         | 12/600 [01:36<11:45,  1.20s/it]
  2%|▏         | 13/600 [01:37<09:30,  1.03it/s]
  2%|▏         | 14/600 [01:37<07:57,  1.23it/s]
  2%|▎         | 15/600 [01:38<07:22,  1.32it/s]
  3%|▎         | 18/600 [01:38<03:43,  2.60it/s]
  3%|▎         | 19/600 [01:38<03:43,  2.60it/s]
  4%|▎         | 21/600 [01:39<02:43,  3.55it/s]
  4%|▎         | 22/600 [01:39<03:05,  3.11it/s]
  4%|▍         | 23/600 [01:39<03:20,  2.88it/s]
  4%|▍         | 24/600 [01:40<03:35,  2.67it/s]
  4%|▍         | 25/600 [01:40<03:40,  2.61it/s]
  4%|▍         | 26/600 [01:41<03:49,  2.50it/s]
  4%|▍         | 27/600 [01:41<03:59,  2.39it/s]
  5%|▍         | 28/600 [01:42<04:01,  2.36it/s]
  5%|▍         | 29/600 [01:42<03:56,  2.41it/s]
  5%|▌         | 30/600 [01:43<03:59,  2.38it/s]
  5%|▌         | 31/600 [01:43<04:02,  2.35it/s]
  5%|▌         | 32/600 [01:43<04:03,  2.33it/s]
  6%|▌         | 33/600 [01:44<05:20,  1.77it/s]
  6%|▌         | 34/600 [01:44<04:23,  2.15it/s]
  6%|▌         | 35/600 [01:45<04:20,  2.17it/s]
  6%|▌         | 36/600 [01:45<04:15,  2.21it/s]
  6%|▌         | 37/600 [01:46<04:12,  2.23it/s]
  6%|▋         | 38/600 [01:47<05:22,  1.74it/s]
  6%|▋         | 39/600 [01:47<04:05,  2.29it/s]
  7%|▋         | 40/600 [01:47<04:42,  1.98it/s]
  7%|▋         | 41/600 [01:48<04:30,  2.07it/s]
  7%|▋         | 42/600 [01:48<04:22,  2.12it/s]
  7%|▋         | 43/600 [01:49<04:15,  2.18it/s]
  7%|▋         | 44/600 [01:49<04:11,  2.21it/s]
  8%|▊         | 45/600 [01:50<04:09,  2.23it/s]
  8%|▊         | 46/600 [01:50<04:06,  2.25it/s]
  8%|▊         | 47/600 [01:51<04:01,  2.29it/s]
  8%|▊         | 48/600 [01:51<04:00,  2.30it/s]
  8%|▊         | 49/600 [01:51<03:59,  2.30it/s]
  8%|▊         | 50/600 [01:52<05:11,  1.77it/s]
  8%|▊         | 51/600 [01:54<07:09,  1.28it/s]
  9%|▊         | 52/600 [01:54<05:18,  1.72it/s]
  9%|▉         | 53/600 [01:54<05:18,  1.72it/s]
  9%|▉         | 54/600 [01:55<04:51,  1.87it/s]
  9%|▉         | 55/600 [01:55<04:34,  1.98it/s]
  9%|▉         | 56/600 [01:56<04:23,  2.07it/s]
 10%|▉         | 57/600 [01:56<04:13,  2.14it/s]
 10%|▉         | 58/600 [01:56<04:07,  2.19it/s]
 10%|▉         | 59/600 [01:57<04:05,  2.21it/s]
 10%|█         | 60/600 [01:57<03:56,  2.28it/s]
 10%|█         | 61/600 [01:58<05:05,  1.77it/s]
 10%|█         | 62/600 [01:58<04:07,  2.17it/s]
 10%|█         | 63/600 [01:59<04:05,  2.19it/s]
 11%|█         | 64/600 [01:59<04:04,  2.19it/s]
 11%|█         | 65/600 [02:00<03:55,  2.27it/s]
 11%|█         | 66/600 [02:00<03:53,  2.28it/s]
 11%|█         | 67/600 [02:01<05:02,  1.76it/s]
 11%|█▏        | 68/600 [02:02<05:17,  1.68it/s]
 12%|█▏        | 70/600 [02:02<04:16,  2.06it/s]
 12%|█▏        | 71/600 [02:03<04:08,  2.13it/s]
 12%|█▏        | 72/600 [02:04<05:01,  1.75it/s]
 12%|█▏        | 73/600 [02:04<03:55,  2.24it/s]
 12%|█▏        | 74/600 [02:04<04:28,  1.96it/s]
 12%|█▎        | 75/600 [02:05<04:18,  2.03it/s]
 13%|█▎        | 76/600 [02:06<05:13,  1.67it/s]
 13%|█▎        | 78/600 [02:06<04:17,  2.03it/s]
 13%|█▎        | 79/600 [02:07<04:08,  2.10it/s]
 13%|█▎        | 80/600 [02:07<04:02,  2.14it/s]
 14%|█▎        | 81/600 [02:08<03:59,  2.16it/s]
 14%|█▎        | 82/600 [02:09<04:54,  1.76it/s]
 14%|█▍        | 83/600 [02:10<06:22,  1.35it/s]
 14%|█▍        | 85/600 [02:10<04:13,  2.03it/s]
 14%|█▍        | 86/600 [02:11<04:04,  2.10it/s]
 14%|█▍        | 87/600 [02:11<03:58,  2.15it/s]
 15%|█▍        | 88/600 [02:11<03:54,  2.19it/s]
 15%|█▍        | 89/600 [02:12<03:50,  2.22it/s]
 15%|█▌        | 90/600 [02:12<03:48,  2.23it/s]
 15%|█▌        | 91/600 [02:13<03:44,  2.27it/s]
 15%|█▌        | 92/600 [02:14<04:51,  1.74it/s]
 16%|█▌        | 93/600 [02:14<03:52,  2.18it/s]
 16%|█▌        | 94/600 [02:14<03:52,  2.18it/s]
 16%|█▌        | 95/600 [02:15<03:46,  2.22it/s]
 16%|█▌        | 96/600 [02:15<03:45,  2.24it/s]
 16%|█▌        | 97/600 [02:16<03:42,  2.26it/s]
 16%|█▋        | 98/600 [02:16<03:42,  2.26it/s]
 16%|█▋        | 99/600 [02:16<03:38,  2.29it/s]
 17%|█▋        | 100/600 [02:17<03:37,  2.30it/s]
 17%|█▋        | 101/600 [02:18<04:38,  1.79it/s]
 17%|█▋        | 102/600 [02:18<03:43,  2.23it/s]
 17%|█▋        | 103/600 [02:18<03:50,  2.16it/s]
 17%|█▋        | 104/600 [02:19<03:44,  2.21it/s]
 18%|█▊        | 105/600 [02:19<03:44,  2.21it/s]
 18%|█▊        | 106/600 [02:20<04:42,  1.75it/s]
 18%|█▊        | 107/600 [02:21<04:59,  1.65it/s]
 18%|█▊        | 109/600 [02:22<04:05,  2.00it/s]
 18%|█▊        | 110/600 [02:22<03:53,  2.10it/s]
 18%|█▊        | 111/600 [02:22<03:47,  2.15it/s]
 19%|█▊        | 112/600 [02:23<03:42,  2.19it/s]
 19%|█▉        | 113/600 [02:23<03:39,  2.22it/s]
 19%|█▉        | 114/600 [02:24<03:36,  2.24it/s]
 19%|█▉        | 115/600 [02:25<04:32,  1.78it/s]
 19%|█▉        | 116/600 [02:25<03:37,  2.22it/s]
 20%|█▉        | 117/600 [02:25<03:46,  2.13it/s]
 20%|█▉        | 118/600 [02:26<03:42,  2.17it/s]
 20%|█▉        | 119/600 [02:27<04:38,  1.73it/s]
 20%|██        | 120/600 [02:27<04:51,  1.65it/s]
 20%|██        | 121/600 [02:28<04:58,  1.61it/s]
 20%|██        | 123/600 [02:29<04:05,  1.95it/s]
 21%|██        | 124/600 [02:29<03:54,  2.03it/s]
 21%|██        | 125/600 [02:29<03:47,  2.09it/s]
 21%|██        | 126/600 [02:30<03:41,  2.14it/s]
 21%|██        | 127/600 [02:31<04:32,  1.73it/s]
 21%|██▏       | 128/600 [02:31<04:44,  1.66it/s]
 22%|██▏       | 130/600 [02:32<03:53,  2.01it/s]
 22%|██▏       | 131/600 [02:33<03:45,  2.08it/s]
 22%|██▏       | 132/600 [02:33<03:40,  2.12it/s]
 22%|██▏       | 133/600 [02:33<03:34,  2.18it/s]
 22%|██▏       | 134/600 [02:34<04:26,  1.75it/s]
 22%|██▎       | 135/600 [02:34<03:25,  2.26it/s]
 23%|██▎       | 136/600 [02:35<03:43,  2.07it/s]
 23%|██▎       | 137/600 [02:36<04:35,  1.68it/s]
 23%|██▎       | 138/600 [02:37<04:44,  1.63it/s]
 23%|██▎       | 140/600 [02:37<03:49,  2.01it/s]
 24%|██▎       | 141/600 [02:38<03:41,  2.07it/s]
 24%|██▎       | 142/600 [02:38<03:35,  2.13it/s]
 24%|██▍       | 143/600 [02:39<03:30,  2.17it/s]
 24%|██▍       | 144/600 [02:39<03:26,  2.20it/s]
 24%|██▍       | 145/600 [02:39<03:23,  2.23it/s]
 24%|██▍       | 146/600 [02:40<03:21,  2.25it/s]
 24%|██▍       | 147/600 [02:40<03:18,  2.28it/s]
 25%|██▍       | 148/600 [02:41<04:14,  1.78it/s]
 25%|██▍       | 149/600 [02:41<03:26,  2.18it/s]
 25%|██▌       | 150/600 [02:42<03:26,  2.18it/s]
 25%|██▌       | 151/600 [02:42<03:22,  2.22it/s]
 25%|██▌       | 152/600 [02:43<03:20,  2.23it/s]
 26%|██▌       | 153/600 [02:43<03:18,  2.25it/s]
 26%|██▌       | 154/600 [02:44<04:14,  1.75it/s]
 26%|██▌       | 155/600 [02:44<03:14,  2.29it/s]
 26%|██▌       | 156/600 [02:45<03:30,  2.11it/s]
 26%|██▌       | 157/600 [02:45<03:23,  2.18it/s]
 26%|██▋       | 158/600 [02:46<03:21,  2.20it/s]
 26%|██▋       | 159/600 [02:46<04:15,  1.73it/s]
 27%|██▋       | 160/600 [02:47<03:13,  2.28it/s]
 27%|██▋       | 161/600 [02:47<03:29,  2.09it/s]
 27%|██▋       | 162/600 [02:48<03:23,  2.15it/s]
 27%|██▋       | 163/600 [02:48<03:19,  2.19it/s]
 27%|██▋       | 164/600 [02:49<04:12,  1.72it/s]
 28%|██▊       | 165/600 [02:49<03:14,  2.23it/s]
 28%|██▊       | 166/600 [02:50<03:26,  2.10it/s]
 28%|██▊       | 167/600 [02:50<03:20,  2.16it/s]
 28%|██▊       | 168/600 [02:50<03:17,  2.19it/s]
 28%|██▊       | 169/600 [02:51<03:13,  2.22it/s]
 28%|██▊       | 170/600 [02:51<03:11,  2.24it/s]
 28%|██▊       | 171/600 [02:52<03:10,  2.26it/s]
 29%|██▊       | 172/600 [02:52<03:08,  2.27it/s]
 29%|██▉       | 173/600 [02:53<03:05,  2.30it/s]
 29%|██▉       | 174/600 [02:53<03:06,  2.28it/s]
 29%|██▉       | 175/600 [02:54<03:59,  1.77it/s]
 29%|██▉       | 176/600 [02:54<03:16,  2.16it/s]
 30%|██▉       | 177/600 [02:55<03:14,  2.17it/s]
 30%|██▉       | 178/600 [02:55<04:06,  1.71it/s]
 30%|███       | 180/600 [02:56<03:22,  2.07it/s]
 30%|███       | 181/600 [02:57<04:11,  1.66it/s]
 30%|███       | 182/600 [03:00<08:26,  1.21s/it]
 30%|███       | 183/600 [03:00<06:37,  1.05it/s]
 31%|███       | 184/600 [03:01<06:15,  1.11it/s]
 31%|███       | 185/600 [03:02<05:40,  1.22it/s]
 31%|███       | 187/600 [03:02<04:14,  1.62it/s]
 31%|███▏      | 188/600 [03:03<03:55,  1.75it/s]
 32%|███▏      | 189/600 [03:03<03:40,  1.86it/s]
 32%|███▏      | 190/600 [03:04<03:28,  1.96it/s]
 32%|███▏      | 191/600 [03:04<03:20,  2.04it/s]
 32%|███▏      | 192/600 [03:05<03:13,  2.11it/s]
 32%|███▏      | 193/600 [03:05<03:08,  2.16it/s]
 32%|███▏      | 194/600 [03:05<03:02,  2.23it/s]
 32%|███▎      | 195/600 [03:06<03:00,  2.24it/s]
 33%|███▎      | 196/600 [03:07<03:50,  1.75it/s]
 33%|███▎      | 197/600 [03:07<03:07,  2.15it/s]
 33%|███▎      | 198/600 [03:07<03:04,  2.18it/s]
 33%|███▎      | 199/600 [03:08<03:01,  2.21it/s]
 33%|███▎      | 200/600 [03:08<02:59,  2.23it/s]
 34%|███▎      | 201/600 [03:09<02:57,  2.25it/s]
 34%|███▎      | 202/600 [03:09<02:56,  2.26it/s]
 34%|███▍      | 203/600 [03:10<02:54,  2.27it/s]
 34%|███▍      | 204/600 [03:10<02:53,  2.28it/s]
 34%|███▍      | 205/600 [03:10<02:50,  2.31it/s]
 34%|███▍      | 206/600 [03:11<02:51,  2.30it/s]
 34%|███▍      | 207/600 [03:11<02:51,  2.30it/s]
 35%|███▍      | 208/600 [03:12<02:50,  2.29it/s]
 35%|███▍      | 209/600 [03:13<03:41,  1.77it/s]
 35%|███▌      | 210/600 [03:13<03:02,  2.14it/s]
 35%|███▌      | 211/600 [03:13<02:57,  2.19it/s]
 35%|███▌      | 212/600 [03:14<03:00,  2.15it/s]
 36%|███▌      | 213/600 [03:14<02:51,  2.26it/s]
 36%|███▌      | 214/600 [03:15<03:40,  1.75it/s]
 36%|███▌      | 215/600 [03:15<02:46,  2.31it/s]
 36%|███▌      | 216/600 [03:16<03:01,  2.12it/s]
 36%|███▌      | 217/600 [03:16<02:56,  2.17it/s]
 36%|███▋      | 218/600 [03:17<02:53,  2.20it/s]
 36%|███▋      | 219/600 [03:17<02:50,  2.23it/s]
 37%|███▋      | 220/600 [03:18<02:48,  2.25it/s]
 37%|███▋      | 221/600 [03:18<02:47,  2.26it/s]
 37%|███▋      | 222/600 [03:18<02:46,  2.27it/s]
 37%|███▋      | 223/600 [03:19<02:43,  2.31it/s]
 37%|███▋      | 224/600 [03:19<02:42,  2.31it/s]
 38%|███▊      | 225/600 [03:20<02:42,  2.31it/s]
 38%|███▊      | 226/600 [03:21<03:30,  1.78it/s]
 38%|███▊      | 227/600 [03:21<03:40,  1.69it/s]
 38%|███▊      | 229/600 [03:22<02:59,  2.06it/s]
 38%|███▊      | 230/600 [03:22<02:53,  2.13it/s]
 38%|███▊      | 231/600 [03:23<02:50,  2.17it/s]
 39%|███▊      | 232/600 [03:23<02:46,  2.21it/s]
 39%|███▉      | 233/600 [03:24<02:44,  2.23it/s]
 39%|███▉      | 234/600 [03:24<02:42,  2.26it/s]
 39%|███▉      | 235/600 [03:24<02:40,  2.27it/s]
 39%|███▉      | 236/600 [03:25<02:37,  2.31it/s]
 40%|███▉      | 237/600 [03:26<03:24,  1.78it/s]
 40%|███▉      | 238/600 [03:26<02:43,  2.21it/s]
 40%|███▉      | 239/600 [03:26<02:45,  2.18it/s]
 40%|████      | 240/600 [03:27<02:41,  2.22it/s]
 40%|████      | 241/600 [03:27<02:39,  2.25it/s]
 40%|████      | 242/600 [03:28<02:37,  2.27it/s]
 40%|████      | 243/600 [03:29<03:22,  1.76it/s]
 41%|████      | 244/600 [03:29<03:32,  1.67it/s]
 41%|████      | 246/600 [03:30<02:53,  2.04it/s]
 41%|████      | 247/600 [03:30<02:46,  2.12it/s]
 41%|████▏     | 248/600 [03:31<03:22,  1.74it/s]
 42%|████▏     | 249/600 [03:31<02:36,  2.24it/s]
 42%|████▏     | 250/600 [03:32<02:53,  2.02it/s]
 42%|████▏     | 251/600 [03:32<02:46,  2.10it/s]
 42%|████▏     | 252/600 [03:33<03:24,  1.70it/s]
 42%|████▏     | 253/600 [03:33<02:34,  2.24it/s]
 42%|████▏     | 254/600 [03:34<02:53,  1.99it/s]
 42%|████▎     | 255/600 [03:34<02:45,  2.08it/s]
 43%|████▎     | 256/600 [03:35<02:40,  2.14it/s]
 43%|████▎     | 257/600 [03:35<02:36,  2.19it/s]
 43%|████▎     | 258/600 [03:36<02:34,  2.22it/s]
 43%|████▎     | 259/600 [03:36<02:32,  2.24it/s]
 43%|████▎     | 260/600 [03:37<03:12,  1.77it/s]
 44%|████▎     | 261/600 [03:37<02:57,  1.91it/s]
 44%|████▎     | 262/600 [03:38<02:47,  2.01it/s]
 44%|████▍     | 263/600 [03:38<02:40,  2.09it/s]
 44%|████▍     | 264/600 [03:39<02:36,  2.15it/s]
 44%|████▍     | 265/600 [03:39<02:32,  2.19it/s]
 44%|████▍     | 266/600 [03:40<02:29,  2.23it/s]
 44%|████▍     | 267/600 [03:40<02:26,  2.28it/s]
 45%|████▍     | 268/600 [03:40<02:25,  2.29it/s]
 45%|████▍     | 269/600 [03:41<03:07,  1.77it/s]
 45%|████▌     | 270/600 [03:42<02:41,  2.05it/s]
 45%|████▌     | 271/600 [03:42<02:35,  2.12it/s]
 45%|████▌     | 272/600 [03:43<02:31,  2.17it/s]
 46%|████▌     | 273/600 [03:43<02:27,  2.22it/s]
 46%|████▌     | 274/600 [03:43<02:25,  2.24it/s]
 46%|████▌     | 275/600 [03:44<02:23,  2.26it/s]
 46%|████▌     | 276/600 [03:44<02:22,  2.28it/s]
 46%|████▌     | 277/600 [03:45<02:21,  2.28it/s]
 46%|████▋     | 278/600 [03:46<03:00,  1.79it/s]
 46%|████▋     | 279/600 [03:46<02:24,  2.23it/s]
 47%|████▋     | 280/600 [03:46<02:27,  2.18it/s]
 47%|████▋     | 281/600 [03:47<02:23,  2.23it/s]
 47%|████▋     | 282/600 [03:47<02:22,  2.24it/s]
 47%|████▋     | 283/600 [03:48<03:01,  1.75it/s]
 47%|████▋     | 284/600 [03:49<03:09,  1.66it/s]
 48%|████▊     | 286/600 [03:49<02:36,  2.01it/s]
 48%|████▊     | 287/600 [03:50<02:30,  2.08it/s]
 48%|████▊     | 288/600 [03:50<02:26,  2.13it/s]
 48%|████▊     | 289/600 [03:51<02:22,  2.18it/s]
 48%|████▊     | 290/600 [03:51<02:20,  2.21it/s]
 48%|████▊     | 291/600 [03:52<02:18,  2.24it/s]
 49%|████▊     | 292/600 [03:52<02:53,  1.78it/s]
 49%|████▉     | 293/600 [03:53<02:19,  2.21it/s]
 49%|████▉     | 294/600 [03:53<02:21,  2.16it/s]
 49%|████▉     | 295/600 [03:53<02:18,  2.20it/s]
 49%|████▉     | 296/600 [03:54<02:55,  1.73it/s]
 50%|████▉     | 297/600 [03:55<03:03,  1.65it/s]
 50%|████▉     | 298/600 [03:56<03:08,  1.60it/s]
 50%|█████     | 300/600 [03:56<02:32,  1.97it/s]
 50%|█████     | 301/600 [03:57<02:25,  2.05it/s]
 50%|█████     | 302/600 [03:57<02:21,  2.10it/s]
 50%|█████     | 303/600 [03:58<02:17,  2.16it/s]
 51%|█████     | 304/600 [03:59<02:50,  1.74it/s]
 51%|█████     | 305/600 [03:59<02:57,  1.66it/s]
 51%|█████     | 307/600 [04:00<02:27,  1.99it/s]
 51%|█████▏    | 308/600 [04:00<02:21,  2.06it/s]
 52%|█████▏    | 309/600 [04:01<02:17,  2.11it/s]
 52%|█████▏    | 310/600 [04:01<02:13,  2.17it/s]
 52%|█████▏    | 311/600 [04:02<02:46,  1.74it/s]
 52%|█████▏    | 312/600 [04:02<02:08,  2.24it/s]
 52%|█████▏    | 313/600 [04:03<02:17,  2.09it/s]
 52%|█████▏    | 314/600 [04:04<02:49,  1.69it/s]
 52%|█████▎    | 315/600 [04:04<02:54,  1.63it/s]
 53%|█████▎    | 317/600 [04:05<02:22,  1.99it/s]
 53%|█████▎    | 318/600 [04:06<02:16,  2.07it/s]
 53%|█████▎    | 319/600 [04:06<02:13,  2.11it/s]
 53%|█████▎    | 320/600 [04:06<02:09,  2.16it/s]
 54%|█████▎    | 321/600 [04:07<02:07,  2.20it/s]
 54%|█████▎    | 322/600 [04:07<02:04,  2.22it/s]
 54%|█████▍    | 323/600 [04:08<02:03,  2.25it/s]
 54%|█████▍    | 324/600 [04:08<02:00,  2.29it/s]
 54%|█████▍    | 325/600 [04:09<02:34,  1.77it/s]
 54%|█████▍    | 326/600 [04:09<02:05,  2.18it/s]
 55%|█████▍    | 327/600 [04:10<02:05,  2.17it/s]
 55%|█████▍    | 328/600 [04:10<02:03,  2.21it/s]
 55%|█████▍    | 329/600 [04:11<02:01,  2.23it/s]
 55%|█████▌    | 330/600 [04:11<01:59,  2.25it/s]
 55%|█████▌    | 331/600 [04:12<02:33,  1.75it/s]
 55%|█████▌    | 332/600 [04:12<01:57,  2.29it/s]
 56%|█████▌    | 333/600 [04:13<02:05,  2.12it/s]
 56%|█████▌    | 334/600 [04:13<02:02,  2.17it/s]
 56%|█████▌    | 335/600 [04:13<02:00,  2.20it/s]
 56%|█████▌    | 336/600 [04:14<02:32,  1.74it/s]
 56%|█████▌    | 337/600 [04:14<01:55,  2.28it/s]
 56%|█████▋    | 338/600 [04:15<02:05,  2.09it/s]
 56%|█████▋    | 339/600 [04:15<02:00,  2.16it/s]
 57%|█████▋    | 340/600 [04:16<01:58,  2.19it/s]
 57%|█████▋    | 341/600 [04:17<02:30,  1.73it/s]
 57%|█████▋    | 342/600 [04:17<01:53,  2.27it/s]
 57%|█████▋    | 343/600 [04:17<02:08,  2.00it/s]
 57%|█████▋    | 344/600 [04:18<02:03,  2.08it/s]
 57%|█████▊    | 345/600 [04:18<01:59,  2.14it/s]
 58%|█████▊    | 346/600 [04:19<01:56,  2.18it/s]
 58%|█████▊    | 347/600 [04:19<01:54,  2.21it/s]
 58%|█████▊    | 348/600 [04:20<01:52,  2.24it/s]
 58%|█████▊    | 349/600 [04:20<01:50,  2.27it/s]
 58%|█████▊    | 350/600 [04:21<01:49,  2.29it/s]
 58%|█████▊    | 351/600 [04:21<01:48,  2.29it/s]
 59%|█████▊    | 352/600 [04:22<02:20,  1.76it/s]
 59%|█████▉    | 353/600 [04:22<01:54,  2.16it/s]
 59%|█████▉    | 354/600 [04:23<01:52,  2.18it/s]
 59%|█████▉    | 355/600 [04:23<02:22,  1.72it/s]
 60%|█████▉    | 357/600 [04:24<01:57,  2.07it/s]
 60%|█████▉    | 358/600 [04:26<03:29,  1.16it/s]
 60%|█████▉    | 359/600 [04:28<04:40,  1.16s/it]
 60%|██████    | 360/600 [04:28<03:41,  1.08it/s]
 60%|██████    | 361/600 [04:29<03:25,  1.16it/s]
 60%|██████    | 363/600 [04:30<02:33,  1.55it/s]
 61%|██████    | 364/600 [04:30<02:20,  1.68it/s]
 61%|██████    | 365/600 [04:31<02:10,  1.81it/s]
 61%|██████    | 366/600 [04:31<02:01,  1.92it/s]
 61%|██████    | 367/600 [04:32<01:56,  2.01it/s]
 61%|██████▏   | 368/600 [04:32<01:51,  2.08it/s]
 62%|██████▏   | 369/600 [04:32<01:47,  2.14it/s]
 62%|██████▏   | 370/600 [04:33<01:44,  2.21it/s]
 62%|██████▏   | 371/600 [04:33<01:42,  2.24it/s]
 62%|██████▏   | 372/600 [04:34<02:10,  1.74it/s]
 62%|██████▏   | 373/600 [04:34<01:45,  2.14it/s]
 62%|██████▏   | 374/600 [04:35<01:45,  2.15it/s]
 62%|██████▎   | 375/600 [04:35<01:42,  2.20it/s]
 63%|██████▎   | 376/600 [04:36<01:40,  2.22it/s]
 63%|██████▎   | 377/600 [04:36<01:39,  2.25it/s]
 63%|██████▎   | 378/600 [04:37<01:38,  2.26it/s]
 63%|██████▎   | 379/600 [04:37<01:37,  2.26it/s]
 63%|██████▎   | 380/600 [04:37<01:36,  2.28it/s]
 64%|██████▎   | 381/600 [04:38<01:34,  2.31it/s]
 64%|██████▎   | 382/600 [04:38<01:34,  2.30it/s]
 64%|██████▍   | 383/600 [04:39<01:34,  2.30it/s]
 64%|██████▍   | 384/600 [04:39<01:34,  2.29it/s]
 64%|██████▍   | 385/600 [04:40<02:01,  1.77it/s]
 64%|██████▍   | 386/600 [04:40<01:39,  2.14it/s]
 64%|██████▍   | 387/600 [04:41<01:38,  2.16it/s]
 65%|██████▍   | 388/600 [04:41<01:36,  2.20it/s]
 65%|██████▍   | 389/600 [04:42<01:35,  2.22it/s]
 65%|██████▌   | 390/600 [04:43<02:00,  1.74it/s]
 65%|██████▌   | 391/600 [04:43<01:31,  2.29it/s]
 65%|██████▌   | 392/600 [04:43<01:39,  2.09it/s]
 66%|██████▌   | 393/600 [04:44<01:36,  2.14it/s]
 66%|██████▌   | 394/600 [04:44<01:34,  2.18it/s]
 66%|██████▌   | 395/600 [04:45<01:32,  2.21it/s]
 66%|██████▌   | 396/600 [04:45<01:31,  2.24it/s]
 66%|██████▌   | 397/600 [04:45<01:30,  2.25it/s]
 66%|██████▋   | 398/600 [04:46<01:28,  2.27it/s]
 66%|██████▋   | 399/600 [04:46<01:26,  2.32it/s]
 67%|██████▋   | 400/600 [04:47<01:26,  2.31it/s]
 67%|██████▋   | 401/600 [04:47<01:26,  2.31it/s]
 67%|██████▋   | 402/600 [04:48<01:51,  1.78it/s]
 67%|██████▋   | 403/600 [04:49<01:58,  1.66it/s]
 68%|██████▊   | 405/600 [04:49<01:36,  2.02it/s]
 68%|██████▊   | 406/600 [04:50<01:32,  2.09it/s]
 68%|██████▊   | 407/600 [04:50<01:30,  2.14it/s]
 68%|██████▊   | 408/600 [04:51<01:27,  2.19it/s]
 68%|██████▊   | 409/600 [04:51<01:25,  2.22it/s]
 68%|██████▊   | 410/600 [04:52<01:24,  2.25it/s]
 68%|██████▊   | 411/600 [04:52<01:23,  2.26it/s]
 69%|██████▊   | 412/600 [04:52<01:21,  2.31it/s]
 69%|██████▉   | 413/600 [04:53<01:44,  1.78it/s]
 69%|██████▉   | 414/600 [04:53<01:24,  2.20it/s]
 69%|██████▉   | 415/600 [04:54<01:25,  2.17it/s]
 69%|██████▉   | 416/600 [04:54<01:22,  2.22it/s]
 70%|██████▉   | 417/600 [04:55<01:21,  2.24it/s]
 70%|██████▉   | 418/600 [04:55<01:20,  2.27it/s]
 70%|██████▉   | 419/600 [04:56<01:42,  1.76it/s]
 70%|███████   | 420/600 [04:57<01:47,  1.67it/s]
 70%|███████   | 422/600 [04:58<01:27,  2.03it/s]
 70%|███████   | 423/600 [04:58<01:24,  2.10it/s]
 71%|███████   | 424/600 [04:59<01:41,  1.73it/s]
 71%|███████   | 426/600 [04:59<01:22,  2.12it/s]
 71%|███████▏  | 428/600 [05:00<00:55,  3.09it/s]
 72%|███████▏  | 431/600 [05:00<00:33,  4.97it/s]
 72%|███████▏  | 433/600 [05:00<00:26,  6.40it/s]
 73%|███████▎  | 436/600 [05:00<00:18,  8.73it/s]
 73%|███████▎  | 439/600 [05:00<00:14, 10.94it/s]
 74%|███████▎  | 442/600 [05:00<00:12, 12.94it/s]
 74%|███████▍  | 444/600 [05:00<00:11, 14.16it/s]
 74%|███████▍  | 446/600 [05:01<00:11, 13.95it/s]
 75%|███████▍  | 448/600 [05:01<00:10, 15.19it/s]
 75%|███████▌  | 451/600 [05:01<00:08, 16.81it/s]
 76%|███████▌  | 454/600 [05:01<00:08, 17.88it/s]
 76%|███████▌  | 456/600 [05:01<00:08, 16.58it/s]
 76%|███████▋  | 459/600 [05:01<00:07, 17.75it/s]
 77%|███████▋  | 461/600 [05:01<00:09, 15.16it/s]
 77%|███████▋  | 464/600 [05:02<00:08, 16.68it/s]
 78%|███████▊  | 467/600 [05:02<00:07, 18.00it/s]
 78%|███████▊  | 469/600 [05:02<00:07, 17.36it/s]
 79%|███████▊  | 472/600 [05:02<00:06, 19.31it/s]
 79%|███████▉  | 474/600 [05:02<00:07, 17.23it/s]
 79%|███████▉  | 476/600 [05:02<00:07, 17.13it/s]
 80%|███████▉  | 479/600 [05:02<00:06, 19.29it/s]
 80%|████████  | 481/600 [05:03<00:06, 17.91it/s]
 81%|████████  | 484/600 [05:03<00:06, 19.22it/s]
 81%|████████  | 487/600 [05:03<00:05, 21.17it/s]
 82%|████████▏ | 490/600 [05:03<00:05, 20.82it/s]
 82%|████████▏ | 493/600 [05:03<00:05, 19.06it/s]
 83%|████████▎ | 496/600 [05:03<00:04, 20.98it/s]
 83%|████████▎ | 499/600 [05:03<00:04, 22.70it/s]
 84%|████████▎ | 502/600 [05:03<00:04, 22.07it/s]
 84%|████████▍ | 505/600 [05:04<00:04, 23.59it/s]
 85%|████████▍ | 508/600 [05:04<00:04, 22.81it/s]
 85%|████████▌ | 511/600 [05:04<00:03, 24.14it/s]
 86%|████████▌ | 514/600 [05:04<00:03, 23.31it/s]
 86%|████████▌ | 517/600 [05:04<00:03, 24.75it/s]
 87%|████████▋ | 520/600 [05:04<00:03, 23.67it/s]
 87%|████████▋ | 523/600 [05:04<00:03, 25.05it/s]
 88%|████████▊ | 526/600 [05:04<00:02, 26.11it/s]
 88%|████████▊ | 529/600 [05:05<00:02, 24.68it/s]
 89%|████████▊ | 532/600 [05:05<00:02, 23.82it/s]
 89%|████████▉ | 535/600 [05:06<00:11,  5.53it/s]
 90%|████████▉ | 537/600 [05:06<00:10,  5.84it/s]
 90%|█████████ | 541/600 [05:07<00:06,  8.61it/s]
 91%|█████████ | 545/600 [05:07<00:04, 11.71it/s]
 91%|█████████▏| 548/600 [05:07<00:03, 13.75it/s]
 92%|█████████▏| 552/600 [05:07<00:02, 17.28it/s]
 93%|█████████▎| 556/600 [05:07<00:02, 20.67it/s]
 93%|█████████▎| 560/600 [05:07<00:01, 24.17it/s]
 94%|█████████▍| 564/600 [05:07<00:01, 25.87it/s]
 95%|█████████▍| 568/600 [05:07<00:01, 27.09it/s]
 96%|█████████▌| 573/600 [05:08<00:00, 30.96it/s]
 96%|█████████▋| 578/600 [05:08<00:00, 32.59it/s]
 97%|█████████▋| 582/600 [05:08<00:00, 34.07it/s]
 98%|█████████▊| 588/600 [05:08<00:00, 39.33it/s]
 99%|█████████▉| 593/600 [05:08<00:00, 36.33it/s]
100%|█████████▉| 597/600 [05:08<00:00, 35.30it/s]
100%|██████████| 600/600 [05:08<00:00,  1.94it/s]

============ Serving Benchmark Result ============
Backend:                                 sglang-oai-chat
Traffic request rate:                    4.0       
Max request concurrency:                 not set   
Successful requests:                     596       
Benchmark duration (s):                  308.73    
Total input tokens:                      4953040   
Total input text tokens:                 84912     
Total input vision tokens:               4868128   
Total generated tokens:                  152576    
Total generated tokens (retokenized):    124784    
Request throughput (req/s):              1.93      
Input token throughput (tok/s):          16043.17  
Output token throughput (tok/s):         494.20    
Peak output token throughput (tok/s):    3135.00   
Peak concurrent requests:                482       
Total token throughput (tok/s):          16537.37  
Concurrency:                             295.10    
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   152863.07 
Median E2E Latency (ms):                 161560.77 
P90 E2E Latency (ms):                    186671.72 
P95 E2E Latency (ms):                    189770.31 
P99 E2E Latency (ms):                    192544.11 
---------------Time to First Token----------------
Mean TTFT (ms):                          76953.50  
Median TTFT (ms):                        76099.81  
P90 TTFT (ms):                           139854.04 
P95 TTFT (ms):                           144829.11 
P99 TTFT (ms):                           150402.38 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          297.68    
Median TPOT (ms):                        339.44    
P90 TPOT (ms):                           348.69    
P95 TPOT (ms):                           349.27    
P99 TPOT (ms):                           350.71    
---------------Inter-Token Latency----------------
Mean ITL (ms):                           337.55    
Median ITL (ms):                         420.11    
P90 ITL (ms):                            631.14    
P95 ITL (ms):                            757.49    
P99 ITL (ms):                            1298.19   
Max ITL (ms):                            2378.20   
==================================================
[Sun Jul 26 06:31:25 AM UTC 2026] Rate 4 done.
[Sun Jul 26 06:31:25 AM UTC 2026] All rates complete.